import re
import time
import requests

header = {
    'User-Agent': 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/92.0.4515.131 Safari/537.36',
    "accept": "*/*",
    "accept-language": "en-GB,en-US;q=0.9,en;q=0.8",
    "cache-control": "no-cache",
    "pragma": "no-cache",
    "proxy-connection": "keep-alive",
    "referer": 'http://www.weather.com.cn/',
}

if __name__ == '__main__':
    # url = 'http://d1.weather.com.cn/sk_2d/101300501.html?_=1703999982033'
    # response = requests.get(
    #     # f'http://d1.weather.com.cn/sk_2d/101300501.html?_={int(time.time() * 1000)}',
    #     url=url,
    #     headers=header,
    #
    # )
    # print(response.text)
    # import execjs
    # ctx = execjs.compile(code)
    # print(ctx.call('await send'))

    # pattern = r"prov\[(\d+)] = '(.+)'"
    # text = ("prov[10] = '58321-H 合肥-58321|58424-A 安庆-58424|58221-B 蚌埠-58221|58102-B 亳州-58102|58427-C 池州-58427|58236-C "
    #         "滁州-58236|58203-F 阜阳-58203|58116-H 淮北-58116|70931-H 黄山-70931|58224-H 淮南-58224|58311-L 六安-58311|58336-M "
    #         "马鞍山-58336|58122-S 宿州-58122|58429-T 铜陵-58429|58334-W 芜湖-58334|58433-X 宣城-58433'")
    # wind_str = '西北风1级'
    string = "provqx[10] = ['58321-H 合肥-58321|71873-B 包河-58321|58326-C 巢湖-58321|70000-C 长丰-58321|60765-F 肥西-58321|70005-F 肥东-58321|72115-H 合肥高新技术产业开发区-58321|72116-H 合肥经济技术开发区-58321|72117-H 合肥新站高新技术产业开发区-58321|60622-L 庐江-58321|71871-L 庐阳-58321|71872-S 蜀山-58321|71870-Y 瑶海-58321', '58424-A 安庆-58424|72311-A 安徽安庆经济开发区-58424|71890-D 大观-58424|60606-H 怀宁-58424|60603-Q 潜山-58424|60587-S 宿松-58424|60318-T 桐城-58424|61039-T 太湖-58424|60313-W 望江-58424|60605-Y 岳西-58424|71889-Y 迎江-58424|71891-Y 宜秀-58424', '58221-B 蚌埠-58221|71875-B 蚌山-58221|72110-B 蚌埠市高新技术开发区-58221|72111-B 蚌埠市经济开发区-58221|60600-G 固镇-58221|60601-H 怀远-58221|71877-H 淮上-58221|71874-L 龙子湖-58221|60588-W 五河-58221|71876-Y 禹会-58221', '58102-B 亳州-58102|60595-G 涡阳-58102|60772-L 利辛-58102|60596-M 蒙城-58102|71896-Q 谯城-58102', '58427-C 池州-58427|70003-D 东至-58427|71910-G 贵池-58427|70008-J 九华山-58427|60316-Q 青阳-58427|60319-S 石台-58427', '58236-C 滁州-58236|72112-C 滁州经济技术开发区-58236|60602-D 定远-58236|60170-F 凤阳-58236|60172-L 来安-58236|71898-L 琅琊-58236|60171-M 明光-58236|71899-N 南谯-58236|60598-Q 全椒-58236|72118-S 苏滁现代产业园-58236|60599-T 天长-58236', '58203-F 阜阳-58203|60773-F 阜南-58203|72113-F 阜阳合肥现代产业园区-58203|72114-F 阜阳经济技术开发区-58203|60767-J 界首-58203|60597-L 临泉-58203|60766-T 太和-58203|60169-Y 颍上-58203|71893-Y 颍州-58203|71894-Y 颍东-58203|71895-Y 颍泉-58203', '58116-H 淮北-58116|71900-D 杜集-58116|71902-L 烈山-58116|70969-S 濉溪-58116|71901-X 相山-58116', '70931-H 黄山-70931|71091-H 黄山区-70931|71148-H 黄山风景区-70931|71897-H 徽州-70931|60769-Q 祁门-70931|60768-S 歙县-70931|60314-T 屯溪-70931|60589-X 休宁-70931|60590-Y 黟县-70931', '58224-H 淮南-58224|71393-P 潘集-58224|71885-B 八公山-58224|71882-D 大通-58224|70006-F 凤台-58224|60593-S 寿县-58224|71883-T 田家庵-58224|71884-X 谢家集-58224', '58311-L 六安-58311|60315-H 霍山-58311|60591-H 霍邱-58311|60713-J 金寨-58311|71907-J 金安-58311|60592-S 舒城-58311|71908-Y 裕安-58311|71909-Y 叶集-58311', '58336-M 马鞍山-58336|71888-B 博望-58336|70002-D 当涂-58336|60770-H 和县-58336|61040-H 含山-58336|71886-H 花山-58336|71887-Y 雨山-58336', '58122-S 宿州-58122|70001-D 砀山-58122|70932-L 灵璧-58122|70010-S 泗县-58122|72120-S 宿州经济技术开发区-58122|72121-S 宿州马鞍山现代产业园区-58122|60771-X 萧县-58122|71892-Y 埇桥-58122', '58429-T 铜陵-58429|71905-J 郊区-58429|71903-T 铜官-58429|71904-Y 义安-58429|60604-Z 枞阳-58429', '58334-W 芜湖-58334|72109-A 安徽芜湖长江大桥经济开发区-58334|70004-F 繁昌-58334|71878-J 镜湖-58334|71880-J 鸠江-58334|60168-N 南陵-58334|71881-S 三山-58334|60585-W 芜湖县-58334|60594-W 无为-58334|72119-W 芜湖经济技术开发区-58334|71879-Y 弋江-58334', '58433-X 宣城-58433|70007-G 广德-58433|60173-J 泾县-58433|60174-J 旌德-58433|60586-J 绩溪-58433|70009-L 郎溪-58433|60317-N 宁国-58433|71906-X 宣州-58433|72122-X 宣城市经济开发区-58433']"

    ma = re.match(r"prov\[(\d+)]\s?=\s?'(.+)'", string)

    a = b"\xe9\xab\x98\xe9\x9b\x84".decode()
    print(a)

    # a = re.match(pattern, text)
    if ma:
        content = ma.group(2)
        res = re.findall(r'(\d+)-[A-Z] (\w+)-\d+', content)
        print(res)